const PrivacyPolicy = () => {
  return (
    <div className="border-primary-foreground/50 absolute inset-1/2 z-[2] flex h-2/3 w-[70%] -translate-x-1/2 -translate-y-[60%] flex-col items-center rounded-2xl border bg-white p-5 shadow-lg drop-shadow-lg hover:z-[4]">
      <p className="text-normal pb-2 text-base font-semibold">
        nalsee 개인정보 처리방침
      </p>
      <div className="w-full flex-1 overflow-y-scroll pt-2">
        <p>
          'nalsee' (app.nalsee.site 이하 'nalsee')은 [개인정보 보호법] 제30조에
          따라 사용자의 개인정보 보호 및 관련 고충을 신속하게 처리하기 위해
          아래와 같은 개인정보 처리방침을 수립, 공개합니다. 이
          개인정보처리방침은 2024년 04월 12일부터 적용됩니다.
        </p>
        <br />
        <p>제 1조 (개인정보의 처리 목적)</p>
        <br />

        <p>
          'nalsee'는 다음의 목적을 위하여 개인정보를 처리합니다. 이외의 용도로는
          이용되지 않으며, 목적이 변경될 경우 [개인정보 보호법] 제18조에 따라
          동의를 받는 등 필요한 조치를 이행할 예정입니다.
        </p>
        <br />
        <p>1. 홈페이지 회원가입 및 관리 </p>
        <p>
          회원 가입 의사 확인, 회원 식별 및 인증, 회원 자격 유지·관리 목적으로
          개인정보를 처리합니다.
        </p>
        <br />

        <p>2. 민원사무 처리</p>
        <p>
          민원인의 신원 확인, 민원 내용의 정확한 처리, 연락·통지, 처리결과 통보
          등을 목적으로 개인정보를 처리합니다.
        </p>
        <br />

        <p>3. 마케팅 및 광고에의 활용 신규</p>
        <p>
          서비스(제품) 개발, 맞춤형 서비스 제공, 이벤트 및 광고성 정보 제공 및
          참여기회 제공 등을 목적으로 개인정보를 처리합니다.
        </p>
        <br />

        <p>제 2조 (개인정보의 처리 및 보유 기간)</p>
        <br />

        <p>
          개인정보는 nalsee 제품 서비스 지속을 위해 회원 탈퇴 시까지, 미접속
          회원의 경우 1년 동안 보유 및 사용되며 이후 삭제됩니다.
        </p>
        <br />

        <p>제 3조 (처리하는 개인정보의 항목)</p>
        <br />

        <p>
          필수 항목: 성명, 연락처, 이메일, 서비스 이용 기록, 접속 로그, 쿠키,
          접속 IP 정보, 사용자 위치 정보
        </p>
        <p>
          선택 항목: 신체 정보(키, 몸무게, 체질), 성별, 패션 선호 정보(스타일)
        </p>
        <br />

        <p>제 4조 (개인정보의 제3자 제공에 관한 사항)</p>
        <br />

        <p>
          개인정보는 원칙적으로 외부에 제공되지 않으며, 예외적인 경우 사용자의
          사전 동의를 얻어 제공됩니다.
        </p>
        <br />

        <p>제 5조(개인정보 처리업무의 위탁에 관한 사항)</p>
        <br />

        <p>
          서비스 향상을 위하여 필요한 경우 외부 전문업체에 위탁하여 처리할 수
          있으며, 위탁 처리하는 개인정보의 항목, 위탁 처리하는 업체의 명칭, 위탁
          처리 목적 등을 사전에 공개합니다.
        </p>
        <br />

        <p>제 6조(개인정보의 파기 절차 및 방법에 관한 사항)</p>
        <br />

        <p>
          개인정보는 보유 기간의 경과, 처리 목적 달성 등 그 이용 목적이 소멸된
          경우에는 즉시 파기합니다. 전자적 파일 형태로 저장된 개인정보는 기술적
          방법을 사용하여 복원이 불가능하도록 안전하게 삭제되며, 종이 문서에
          기록된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.
        </p>
        <br />

        <p>
          제 7조(정보주체와 법정대리인의 권리, 의무 및 행사방법에 관한 사항)
        </p>
        <br />

        <p>
          정보주체는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할
          수 있으며 개인정보 삭제 요청이 가능합니다. 또한 개인정보의 처리가
          일시적으로 정지될 권리를 가집니다.
        </p>
        <br />

        <p>제 8조(개인정보의 안전성 확보조치에 관한 사항)</p>
        <br />

        <p>
          'nalsee'는 개인정보보호법 제29조에 따라 처리하는 개인정보의 기술적,
          관리적 보호 대책을 마련하여 개인정보가 분실, 도난, 유출, 변조 또는
          훼손되지 않도록 안전성 확보에 최선을 다하고 있습니다.
        </p>
        <br />

        <p>제 9조(개인정보 처리방침의 변경에 관한 사항)</p>
        <br />

        <p>
          이 개인정보 처리방침은 법률이나 정책의 변경 내용을 반영하여 개정될 수
          있으며, 개정된 정책은 웹사이트를 통해 공지사항으로 공개됩니다.
        </p>
        <br />

        <p>
          제 10조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에
          관한 사항)
        </p>
        <br />

        <p>
          'nalsee'는 이용자의 정보를 저장하고 수시로 불러오는 '쿠키(cookie)'를
          사용합니다. 쿠키를 통해 이용자의 로그인 상태를 유지 관리할 수
          있습니다. 이용자는 웹브라우저 설정을 통해 쿠키 저장을 거부할 수
          있으나, 쿠키 저장을 거부할 경우 로그인이 필요한 일부 서비스는 이용에
          어려움이 있을 수 있습니다.
        </p>
        <br />

        <p>제 11조(행태정보의 수집·이용·제공 및 거부 등에 관한 사항)</p>
        <br />

        <p>
          'nalsee'는 개인화된 맞춤 서비스를 제공하기 위해 이용자의 서비스 이용
          행태를 분석하고 있습니다. 이 데이터는 익명화되어 처리되며, 개인을
          식별할 수 없는 형태로만 이용됩니다. 이용자는 마케팅 목적으로의 행태
          정보 분석에 대해 거부할 권리가 있습니다.
        </p>
        <br />

        <p>제 12조(추가적인 이용·제공 관련 판단 기준)</p>
        <br />

        <p>
          'nalsee'는 개인정보의 추가적인 이용 또는 제3자 제공 시 정보주체의
          동의를 받으며, 이용 목적, 제공받는 자의 정보, 제공되는 개인정보의 항목
          등을 명시하여 동의를 구합니다.
        </p>
        <br />

        <p>제 13조(가명정보 처리에 관한 사항)</p>
        <br />

        <p>
          'nalsee'에서 처리하는 가명정보는 연구, 통계작성 또는 시장 조사 등의
          목적으로만 사용되며, 어떠한 경우에도 실명으로 재식별되지 않습니다.
          가명정보의 안전성 확보에 필요한 기술적, 관리적 조치가 취해집니다.
        </p>
        <br />

        <p>제 14조(개인정보 보호책임자에 관한 사항)</p>
        <br />

        <p>개인정보 보호책임자: 윤혜진</p>
        <p>연락처: 010-2229-7592</p>
        <p>이메일: imhaejin98@gmail.com</p>
        <p>
          책임자는 'nalsee'의 개인정보 처리 정책의 이행을 감독하며, 정보주체의
          개인정보 관련 문의 및 불만 처리 역할을 담당합니다.
        </p>
        <br />

        <p>제 15조(국내대리인 지정에 관한 사항)</p>
        <br />

        <p>
          'nalsee'는 GDPR 등 해외 개인정보 보호법을 준수하여 필요시 국내
          대리인을 지정할 수 있습니다. 대리인의 세부 사항은 'nalsee' 웹사이트를
          통해 별도로 공지합니다.
        </p>
        <br />

        <p>제 16조(개인정보의 열람청구를 접수·처리하는 부서)</p>
        <br />

        <p>부서명: 에브리코딩</p>
        <p>담당자: 윤혜진</p>
        <p>연락처: 010-2229-7592</p>
        <br />

        <p>제 17조(정보주체의 권익침해에 대한 구제방법)</p>
        <br />

        <p>
          정보주체는 개인정보 침해로 인한 피해를 입은 경우, 'nalsee'의 개인정보
          보호책임자 혹은 해당 부서로 연락을 취할 수 있으며, 필요시
          개인정보보호위원회, 경찰청 사이버안전국 등 관계 기관에 구제를 요청할
          수 있습니다.
        </p>
        <br />

        <p>제 18조(개인정보 처리방침의 변경에 관한 사항)</p>
        <br />

        <p>
          'nalsee'는 법령, 정책 또는 보안기술의 변경에 따라 개인정보 처리방침을
          변경할 수 있습니다. 변경되는 개인정보 처리방침은 최소 7일 전에
          웹사이트를 통해 공지되며, 중대한 변경의 경우 최소 30일 전에
          공지됩니다.
        </p>
        <br />

        <p>제 19조(위치 기반 서비스 관련 사항)</p>
        <br />

        <p>
          본 약관은 nalsee가 제공하는 제품, 기능, 앱, 서비스, 기술,
          소프트웨어에서 제공되는 위치 기반 서비스에 적용됩니다.
        </p>
        <br />

        <p>1. 위치 기반 서비스</p>
        <p>
          nalsee는 회원님께 맞춤화된 콘텐츠와 정보를 제공하고, 회원님이 다른
          사람에게 현재 위치와 방문한 위치를 알릴 수 있도록 하며, 제품을
          개선하기 위해 회원님의 위치 정보를 사용할 수 있습니다. nalsee가
          제공하는 위치 기반 서비스는 다음과 같습니다.
        </p>
        <br />

        <p>
          - 회원님의 현재 위치를 기반으로 위치를 표시하는 서비스 및 이를
          기반으로 하는 기타 앱 서비스(회원님의 위치를 공유, 전송, 게시 또는
          저장하는 것 포함)
        </p>
        <p>
          - 회원님이 상태 업데이트, 사진, 영상, 기타 게시물을 회원님의 위치에
          연결(예: 특정 위치에 체크인 등)하고, 이를 다른 사용자에 공유, 전송
          또는 추천하거나 회원님의 nalsee 페이지에 게시 또는 분류하도록 하는
          서비스 및 이를 기반으로 하는 기타 앱 서비스
        </p>
        <br />

        <p>2. 위치 기반 서비스 요금</p>
        <p>
          nalsee는 위치 기반 서비스에 대한 요금을 사용자에게 부과하지 않습니다.
          그러나 회원님이 위치 기반 서비스를 사용할 때 데이터 요금이 발생할 수
          있습니다.
        </p>
        <br />

        <p>3. 회원님의 권리</p>
        <p>
          nalsee는 nalsee의 개인정보처리방침에 따라 회원님의 위치 정보를 수집,
          이용, 공유합니다. 회원님은 모바일 기기의 위치 서비스 설정을 통해
          기기가 nalsee 제품에 정확한 위치 정보를 공유할지 여부를 관리할 수
          있습니다. 위치 서비스가 해제되어 있는 경우 nalsee는 IP 주소 등을
          활용하여 회원님의 위치를 추정할 수 있습니다
        </p>
        <br />

        <p>4. 위치 기반 정보 이용 사실 확인 자료의 보유 근거 및 보관 기간</p>
        <p>
          nalsee는 위치 정보의 보호 및 이용 등에 관한 법률 제16조 제2항에 따라
          위치 기반 정보 이용 사실 확인 자료를 자동으로 기록, 보존하며 nalsee의
          개인정보방침에 따라 보관합니다.
        </p>
        <p>
          nalsee는 맞춤화된 nalsee 경험을 제공하기 위해 회원님의 계정과 관련된
          개인 정보를 보유합니다. 회원님은 nalsee 계정을 유지하는 동안 활동
          로그를 통해 언제든지 nalsee에 있는 회원님의 게시물(회원님의 게시물에
          포함된 위치 정보 포함) 및 방문한 장소를 검토 및 삭제할 수 있습니다.
        </p>
      </div>
    </div>
  );
};

export default PrivacyPolicy;
